'''
Напишіть функцію process_input, яка приймає рядок і намагається перетворити його в ціле число.
Якщо перетворення успішне, функція повинна повертати квадрат числа.
Якщо рядок не є числом, обробіть ValueError і виведіть повідомлення про помилку.
Якщо рядок порожній, обробіть IndexError,
але перед цим викиньте (raise) це виключення, і виведіть відповідне повідомлення.
Вимоги:
•	У коді повинна бути функція process_input.
•	Функція process_input повинна приймати рядок.
•	Функція process_input повинна намагатися перетворити рядок в ціле число.
•	Якщо перетворення успішне, функція повинна повертати квадрат числа.
•	Функція повинна обробляти ValueError і виводити повідомлення про помилку, якщо рядок не є числом.
•	Функція повинна обробляти IndexError і виводити повідомлення про помилку, якщо рядок порожній
'''
def process_input(input_string):
    try:
        if input_string == "":
            raise IndexError(f"Помилка: введено порожній рядок.")
        number=int(input_string)
        return number **2
    except ValueError:
       print( " Помилка: введений рядок не є числом.")
    except IndexError as e:
        print(e)



print(process_input("5"))         # Вивід: 25
print(process_input("abc"))       # Вивід: Помилка: введений рядок не є числом.
print(process_input(""))          # Вивід: Помилка: введено порожній рядок.