'''
Напишіть функцію convert_and_sum, яка приймає два аргументи у вигляді рядків, перетворює їх у цілі
числа і повертає їхню суму. Опрацюйте виключення, які можуть виникнути під час перетворення рядків у числа
(наприклад, якщо передано некоректні значення).
 У разі виникнення виключення, програма має повернути рядок із зазначенням помилки, наприклад, "Некоректне значення".
Вимоги:
•	Програма повинна включати функцію з назвою convert_and_sum, яка приймає два аргументи у вигляді рядків.
•	Функція convert_and_sum повинна перетворювати передані рядки у цілі числа.
•	Функція convert_and_sum повинна повертати суму двох перетворених чисел.
•	Функція convert_and_sum повинна обробляти виключення, що виникають при перетворенні
 рядків у цілі числа, і коректно обробляти некоректні значення.
'''
def convert_and_sum(str_1,str_2):
    try:
        int_1 = int(str_1)
        int_2 = int(str_2)
    except ValueError:
        return "Помилка: некоректне значення."
    else:
        return int_1+int_2

print(convert_and_sum(1,2))
print(convert_and_sum("text",1))
print(convert_and_sum(1,"text"))






