'''
Напишіть функцію safe_division, яка приймає два числа і виконує їх ділення.
Обробіть винятки, які можуть виникнути при діленні на нуль і при передачі
некоректних значень (наприклад, рядка замість чисел).
Функція повинна повертати повідомлення про помилку або результат ділення.
Вимоги:
•	Функція safe_division повинна обробляти виняток ZeroDivisionError,
 який виникає при діленні на нуль, і повертати повідомлення про помилку.
•	Функція safe_division повинна обробляти виняток TypeError,
який виникає при передачі некоректних значень (наприклад, рядки замість чисел),
і повертати відповідне повідомлення про помилку.
•	Функція safe_division повинна повертати результат ділення у випадку,
 якщо вхідні дані коректні і ділення не на нуль.
•	Функція повинна мати блок try-except, який коректно обробляє всі можливі винятки,
 пов'язані з некоректним вводом і діленням на нуль.
'''
def safe_division(number_1,number_2):
    try:
        result=number_1/number_2
    except ZeroDivisionError:
        return "На нуль ділити не можна"
    except TypeError:
        return "Не коректні значення"
    else:
        return(result)

print(safe_division(10, 2))  # Результат ділення: 5.0
print(safe_division(10, 0))  # Помилка: ділення на нуль неможливе.
print(safe_division('10', 2))  # Помилка: обидва аргументи повинні бути числами.

